Revit 2027 API
View.SunlightIntensity Property
 The intensity of the simulated (directional) sunlight. 0 = no directional light; maximum value is 100.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int SunlightIntensity { get; set; }
Public Property SunlightIntensity As Integer
	Get
	Set
public:
property int SunlightIntensity {
	int get ();
	void set (int value);
}
member SunlightIntensity : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value is invalid. The valid range is 0 through 100
InvalidOperationException |  When setting this property: This view does not contain display-related properties.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace